###############################################################################
# Created by write_sdc
###############################################################################
current_design ariane
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name main_clk -period 950.0000 [get_ports {clk_i}]
###############################################################################
# Environment
###############################################################################
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 10.0000 [current_design]
